console.log(`Уважаемый проверяющий, соратник по RS SCHOOL, сердечно поздравляю с наступающим Новым годом! 
Желаю всяческих успехов в освоении курса, хорошо отдохнуть перед финальными тасками, воплотить свои самые заветные мечты! 
Крепкого здоровья! 
Я старалась изо всех сил, если проверите чуть позже,  возможны улучшения)) 

А пока моя самооценка 120.

1. Вёрстка страниц приложения и навигация между ними +30

2. Меню с настройками +40
У пользователя есть возможность:
выбрать один из нескольких (минимум 8) фонов +10
выбрать одну из нескольких (минимум 4) ёлок +10
включить/отключить падающий снег +10 (первый раз чтобы включить снег надо два раза щелкнуть по кнопке, потом меняется по одному клику)
включить/отключить новогоднюю музыку +10

local storage +10,/0 - локал не сделан

3. Гирлянда +20
Гирлянда реализуется средствами css без использования изображений

У пользователя есть возможность:
добавить на ёлку мерцающую разноцветную гирлянду +20
выбрать один из нескольких (минимум 4) цветов лампочек гирлянды или оставить её разноцветной +10|0
внешний вид гирлянды соответствует предложенному образцу или является его улучшенной версией +10|0

4. Игрушки в избранном +30/из 80
в слотах находятся игрушки, которые были добавлены в избранное на странице с игрушками +10/0
если в избранное не была добавлена ни одна игрушка, в слотах отображаются первые 20 игрушек коллекции исходных данных +10/10
игрушки из слотов с игрушками можно перетянуть на ёлку используя drag and drop +10/10
если в процессе перетягивания игрушку отпускают за пределами ёлки, она возвращается в свой слот +10,/0
повешенные на ёлку игрушки можно перетягивать в пределах ёлки +10/0
повешенные на ёлку игрушки можно снимать с ёлки, при этом они возвращаются в свой слот +10/0
возле слота с каждой игрушкой указывается количество игрушек в слоте равное количеству экземпляров игрушки в массиве с исходными данными +10
когда игрушку "вешают на ёлку" количество игрушек в слоте уменьшается, когда игрушку "снимают с ёлки", 
количество игрушек в слоте увеличивается, когда все экземпляры игрушки помещаются на ёлку, отображается пустой слот +10/0

 `);
