console.log(`Cамооценка 93 балла: 
 сделано:
 1. Страница с игрушками содержит карточки всех игрушек а также фильтры, строку поиска, поле для сортировки. Выполняются требования к вёрстке +10
2. Карточка игрушки содержит её изображение, название, текстом или условным значком обозначено количество экземпляров, год покупки, форма, цвет, размер, является ли игрушка любимой +10
Карточки игрушек добавляются динамически средствами JavaScript (на кросс-чеке этот пункт не проверяется)
3. Добавление игрушек в избранное +20
кликая по карточке с игрушкой или по кнопке на ней игрушку можно добавлять в избранное или удалять из избранного. Карточки добавленных в избранное игрушек внешне отличаются от остальных +10
на странице отображается количество добавленных в избранное игрушек. При попытке добавить в избранное больше 20 игрушек, выводится всплывающее уведомление с текстом "Извините, все слоты заполнены" +10
4. Сортировка +20
Сортируются только те игрушки, которые в данный момент отображаются на странице
сортировка игрушек по названию в возрастающем и спадающем порядке +10
сортировка игрушек по году их приобретения в возрастающем и спадающем порядке +10
для фильтрации в указанном диапазоне используется range slider с двумя ползунками. При перемещении ползунков отображается их текущее значение, разный цвет слайдера до и после ползунка +10
 поиск:
 при открытии приложения курсор находится в поле поиска +2
автозаполнение поля поиска отключено (нет выпадающего списка с предыдущими запросами) +2
есть placeholder +2
в поле поиска есть крестик, позволяющий очистить поле поиска +2
функционал, улучшающий качество приложения, удобство пользования им +6 :  добавлена кнопка для уменьшения количества выбранных игрушек на каждой карточке (пока с багом), есть возможность выбрать несколько игрушек одного вида с карточки, добавлена кнопка для отмены выбора всех игрушек
 `);
